const quizData = [
    "연맹체 국가의 정의를 서술하시오.",
    "다음 특징을 가지는 국가는 무엇인지 이름을 쓰시오.",
    "삼국이 왕의 권력이 강해지며 발전하게 된 형태의 국가는?",
    "연맹체 국가와 중앙 집권적 영역 국가의 차이점을 서술하시오.",
    "법흥왕의 업적 세가지를 서술하시오.",
    "나당 동맹이 체결되게 된 배경을 신라와 당 입장 모두에서 서술하시오.",
    "소수림왕의 업적을 서술하시오.(시험 범위 아닐수도)"
];

const quizDesc = [
    "",
    "왕을 비롯한 여러 가들이 각자의 영역을 다스리며 나라를 통치하는 국가.",
    "",
    "",
    "",
    "",
    "",
]

const quizAnswer = [
    "왕을 비롯한 여러 가들이 각자의 영역을 다스리며 나라를 통치하는 국가.",
    "연맹체 국가",
    "중앙 집권적 영역 국가",
    "연맹체 국가는 왕을 비롯한 여러 가들이 같이 나라를 통치하는 반면, 중앙 집권적 영역 국가는 왕을 중심으로 5부나 6부의 지배층은 독자성을 잃고 관리가 된 형태이다.",
    "율령 반포, 17관등제, 공복제, 골품제 정비, 불교 공인",
    "당시 신라는 백제의 침략을 받아 위기인 상황임. 고구려와 왜에 모두 지원을 요청하였으나 거절 당함. 따라서 당에 지원을 요청하게되었고, 당은 이를 받아들임. 당 입장에서는 이전에 고구려를 침략하며 어려움을 느껴 외세의 도움이 필요하다 생각함. 따라서 나당 동맹이 체결됨.",
    "태학 설립, 율령 반포, 불교 수용",
];

export { quizData, quizAnswer, quizDesc };